import React from "react";
import "../../App.css";
import { BannerForEndHTNL } from "../../components/EndHTML/BannerForEndHTML";
import  exapmle_shop  from "../../assets/img/example_shop.png";
import { useNavigate } from "react-router";

function EndHTML() {
  const navigate = useNavigate();
  function handleClick() {
    navigate("/startcss");
  }

  return (
    <div>
      <BannerForEndHTNL />
      <section>
        <div className="study_page">
          <div>
            <h1>
              <strong> Почнемо верстати! </strong>
            </h1>
            <h2>
              <strong> Але для початку, що таке верстка? </strong>
            </h2>
            <span>
              Верстка сайту - це процес створення структури та вигляду
              веб-сторінки з використанням HTML, CSS та інших технологій.
              Верстка включає в себе створення розмітки та розміщення елементів
              на сторінці, встановлення стилів для кожного елементу (наприклад,
              кольору, розміру шрифту, відстані між елементами тощо) та
              забезпечення коректної роботи сайту на різних пристроях та в
              різних браузерах. Одним з головних завдань верстки є забезпечення
              доступності та зручності використання сайту для користувачів. Це
              означає, що структура та вигляд сайту повинні бути зрозумілими та
              логічними для користувача, забезпечувати швидкий доступ до
              необхідної інформації та максимальний комфорт при перегляді
              сторінки. Верстка є важливою складовою веб-розробки та дозволяє
              створювати ефективні та привабливі сайти для різних цілей, таких
              як продаж продуктів, розміщення новин, надання послуг та багато
              іншого.
            </span>
            <h1>Отже, наша структура сайту буде виглядати наступним чином:</h1>
            <pre>
              <code>
                {`
<!DOCTYPE html>
<html>
<head>
	<title>Мій Магазин</title>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
	<header class="header">
		<h1>Мій Магазин</h1>
	</header>

	<main class="container">
		<div class="product">
			<img src="https://via.placeholder.com/400x300" alt="Product">
			<h3>Товар 1</h3>
			<p>Ціна: $10</p>
			<a href="#" class="btn">Купити</a>
		</div>

		<div class="product">
			<img src="https://via.placeholder.com/400x300" alt="Product">
			<h3>Товар 2</h3>
			<p>Ціна: $20</p>
			<a href="#" class="btn">Купити</a>
		</div>

		<div class="product">
			<img src="https://via.placeholder.com/400x300" alt="Product">
			<h3>Товар 3</h3>
			<p>Ціна: $30</p>
			<a href="#" class="btn">Купити</a>
		</div>
	</main>
</body>
</html>

        `}
              </code>
            </pre>
            <span>Структура прикладу готового сайту</span>
            <h2>А ось так сам сайт буде виглядати:</h2>
            <img src={exapmle_shop} style={{ width: "500px" }}></img>
            <p>Виглядає не дуже, але далі ми будемо наповнювати його стилями</p>
            <h2>Розбираємось в архітектурі</h2>
            <pre>
              <code>
                {`
<main class="container">
		<div class="product">
			<img src="https://via.placeholder.com/400x300" alt="Product">
			<h3>Товар 1</h3>
			<p>Ціна: $10</p>
			<a href="#" class="btn">Купити</a>
		</div>

		<div class="product">
			<img src="https://via.placeholder.com/400x300" alt="Product">
			<h3>Товар 2</h3>
			<p>Ціна: $20</p>
			<a href="#" class="btn">Купити</a>
		</div>

		<div class="product">
			<img src="https://via.placeholder.com/400x300" alt="Product">
			<h3>Товар 3</h3>
			<p>Ціна: $30</p>
			<a href="#" class="btn">Купити</a>
		</div>
	</main>
        `}
              </code>
            </pre>
            <p>У цьому коді використовуються наступні елементи:</p>
            <ul>
              <li>
                {`<main>`} : Головний контейнер, який охоплює всі блоки
                продуктів.
              </li>
              <li>
                class="container" : Клас, що задає стилі для контейнера. Цей
                клас може мати власні стилі, задані в CSS.
              </li>
              <li>
                {`<div class="product">`} : Блок продукту. Цей блок містить
                зображення продукту {`<img>`}, назву продукту {`<h3>`}, ціну
                продукту {`<p>`} та кнопку "Купити" {`<a class="btn">`}{" "}
              </li>
              <li>
                {`<img src="https://via.placeholder.com/400x300" alt="Product">`}{" "}
                : Зображення продукту. src атрибут вказує шлях до зображення, а
                alt атрибут надає альтернативний текст, який відображається,
                якщо зображення не може бути завантажене.
              </li>
              <li>
                {`<h3>Товар 1</h3>`}: Заголовок продукту, в даному випадку
                "Товар 1".
              </li>
              <li>
                {`<p>Ціна: $10</p>`} : Абзац, що відображає ціну продукту.
              </li>
              <li>
                {`<a href="#" class="btn">Купити</a>`}: Посилання "Купити" з
                класом "btn". href="#" вказує, що це посилання не призначене для
                переходу на іншу сторінку.
              </li>
            </ul>
            <p>
              Також в цьому коді ми використовуємо різноманітні CSS класи, це
              зроблено для того, щоб по окремому "ключу" звертатись до того, чи
              іншого блоку та стилізувати його. Детальніше ми поговоримо про них
              у відповідному блоці
            </p>
            <h2>Перелік наших класів:</h2>
            <ul>
              <li>
                container: Встановлює контейнер блоків продуктів як гнучкий
                контейнер, який розташовує елементи по центру та обтікає їх на
                новий рядок, якщо не вистачає місця.
              </li>
              <li>
                .product: Встановлює стилі для блоку продукту, такі як ширина,
                відступи, фон, радіус кутів та тінь.
              </li>
              <li>
                .product img: Встановлює розміри та відступи для зображень
                продуктів.
              </li>
              <li>
                .product h3: Встановлює розмір шрифту та відступи для заголовків
                продуктів.
              </li>
              <li>
                .product p: Встановлює розмір шрифту, колір та відступи для
                тексту з ціною продуктів.
              </li>
              <li>
                .product .btn: Встановлює стилі для кнопок "Купити", такі як
                кольори, оточення, текст та перехідний ефект при наведенні.
              </li>
              <li>
                .product .btn:hover: Встановлює стиль кнопки при наведенні
                курсору, для надання візуального змінного ефекту.
              </li>
            </ul>
            <h1>Детальніше про класи:</h1>
            <p>
              У HTML елементи можуть мати класи, які використовуються для
              надання їм спільних стилів або для здійснення маніпуляцій за
              допомогою JavaScript. Класи в HTML використовуються для групування
              елементів з однаковими характеристиками або функціональністю. Для
              задання класу для елементу використовується атрибут class.
              Значення цього атрибуту є простим списком імен класів, розділених
              пробілами.
            </p>
          </div>
          <button className="next_page_study" onClick={handleClick}>
            <span>До блоку вивчення CSS</span>
          </button>
        </div>
      </section>
    </div>
  );
}

export default EndHTML;
