import React from 'react'
import "../../App.css"
import { BannerForStartIT } from '../../components/StartIT.js/BannerForStartIT';


function StartIT() {
  return (
    <div>
      <BannerForStartIT />
      <section>
        <div>
          <div>
            <h1>
              Зазвичай в IT-індустрії можна виділити декілька основних секторів:
            </h1>
            <ul>
              <li>
                <strong> (Software Development) :</strong> Розробка програмного
                забезпечення команда програмістів розробляє нові програми та
                додатки для різних платформ, таких як комп'ютери, смартфони та
                планшети.
              </li>
              <li>
                <strong>(Web Development) :</strong> Веб-розробка веб-розробники
                створюють та підтримують веб-сайти, веб-додатки та інші
                онлайн-ресурси.
              </li>
              <li>
                <strong>(IT Consulting) : </strong>ІТ-консалтинг консультанти
                пропонують свої послуги з планування та розробки ІТ-проектів, а
                також з управління ІТ-інфраструктурою компаній.
              </li>
              <li>
                <strong>(Cloud Computing) :</strong> Хмарні технології хмарні
                сервіси забезпечують доступ до комп'ютерних ресурсів через
                Інтернет, що дозволяє користувачам зберігати та обробляти дані в
                онлайн-режимі.
              </li>
              <li>
                <strong>(Cybersecurity) :</strong> Кібербезпека спеціалісти з
                кібербезпеки займаються захистом комп'ютерних систем та мереж
                від хакерських атак та вірусів.
              </li>
            </ul>
            <p>
              Кожен з цих секторів має свої власні методи роботи та процеси
              розробки, але всі вони базуються на використанні комп'ютерів та
              програмного забезпечення. Робота в IT-індустрії вимагає високої
              кваліфікації та знань у сфері технологій, а також здатності до
              постійного навчання та саморозвитку, оскільки цей сектор змінює
            </p>
          </div>
        </div>
      </section>
    </div>
  );
}

export default StartIT