import React from "react";
import "../../App.css";
import { BannerForStartHTML } from "../../components/StartHTML/BannerForStartHTML";
import { useNavigate } from "react-router";

function StartHTML() {

  const tegs = [
    {
      title: "<html> - визначає початок та кінець HTML-документа;",
    },
    {
      title: "<head> - визначає метадані документа, такі як заголовок сторінки та посилання на CSS-файли;",
    },
    {
      title: "<title> - визначає заголовок документа, який відображається в заголовку вкладки браузера;",
    },
    {
      title: "<body> - визначає основний вміст документа;",
    },
    {
      title: "<p> - визначає абзац;",
    },
    {
      title: "<a> - визначає гіперпосилання на іншу веб-сторінку або на зовнішній ресурс;",
    },
    {
      title: "<img> - визначає зображення, яке відображається на веб-сторінці;",
    },
    {
      title: "<div> - визначає блок на веб-сторінці, який можна використовувати для групування інших елементів;",
    },
    {
      title: "<span> - визначає текстовий блок на веб-сторінці.",
    }
  ];
  const navigate = useNavigate();
  function handleClick() {
    navigate("/endhtml");
  }

  return (
    <div>
      <BannerForStartHTML />
      <section>
        <div className="study_page">
          <div>
            <h1>
              <strong> HTML</strong> (Hypertext Markup Language) - це мова
              розмітки, яка використовується для створення веб-сторінок.
            </h1>
            <span>
              HTML дозволяє створювати веб-сторінки з текстом, зображеннями,
              відео, аудіо та іншими елементами. Основними елементами HTML є
              теги, які вказують браузеру, як відображати вміст веб-сторінки.
              Теги складаються з назви тегу, який заключений у знаки , та можуть
              мати атрибути, які використовуються для передачі додаткової
              інформації про елемент. Наприклад, тег "p" використовується для
              визначення абзацу, а тег "img" використовується для відображення
              зображення.
            </span>
            <h2>Ось деякі з найбільш поширених тегів HTML:</h2>
            <ul>
              {tegs.map((teg) => (
                <ul key={teg.title}>
                  <li>{teg.title}</li>
                </ul>
              ))}
            </ul>
            <p>
              Крім основних тегів, HTML має багато інших тегів та можливостей,
              які дозволяють створювати різноманітні веб-сторінки. Весь список
              тегів ви можете знайти за цим <br />
              <a href="https://www.w3schools.com/tags/">посиланням</a>
            </p>
            <h1>Основні структури HTML-документу мають наступний вигляд:</h1>
            <pre>
              <code>
                {`
<!DOCTYPE html>
<html>
  <head>
    <title>Заголовок сторінки</title>
  </head>
  <body>
    <h1>Назва</h1>
    <p>Текст сторінки</p>
  </body>
</html>

        `}
              </code>
            </pre>
            <span>
              Ця структура містить основні елементи HTML - `html`, `head` і
              `body`. Заголовок сторінки визначається за допомогою тега title, а
              зміст сторінки розміщується в тегах `h1` та `p` `h1``
            </span>
            <h2>
              У HTML існує кілька способів розподілу блоків, або елементів, на
              веб-сторінці. Основні методи включають в себе:
            </h2>
            <ul>
              <li>
                Використання тегів блокування. В HTML існують теги блокування,
                такі як `div` і `section`, які можуть бути використані для
                групування і розподілу блоків на сторінці. Ці теги мають широку
                ширину за замовчуванням і можуть займати всю доступну ширину
                батьківського елемента або бути налаштованими з використанням
                CSS.
              </li>
              <li>
                Використання тегів вбудовування. HTML також містить теги
                вбудовування, такі як `span`, які можуть бути використані для
                відображення тексту або інших елементів на сторінці. Ці теги
                зазвичай не мають ширини за замовчуванням і займають тільки той
                простір, який потрібен для відображення їх вмісту.
              </li>
              <li>
                Використання CSS-класів і ідентифікаторів. CSS надає можливість
                стилізувати HTML-елементи з використанням класів і
                ідентифікаторів. Ці класи та ідентифікатори можуть бути додані
                до будь-якого HTML-елементу, щоб дати їм особливі стилі або
                поведінку. Вони можуть також бути використані для групування
                елементів і їх розподілу на сторінці з використанням
                CSS-селекторів.
              </li>
              <li>
                Використання таблиць. HTML також містить теги таблиць, такі як
                `table`, які можуть бути використані для відображення даних в
                структурованому форматі. Таблиці складаються з рядків і
                стовпців, і їх можна використовувати для розподілу контенту на
                сторінці.
              </li>
            </ul>
          </div>
          <button className="next_page_study" onClick={handleClick}>
            <span>До наступного блоку про HTML</span>
          </button>
        </div>
      </section>
    </div>
  );
}

export default StartHTML;
